app/controllers/posts_controller.rb

SELECT COUNT(*) FROM "posts"
---
  def index
  	@post  = Post.new
  	# @posts = Post.all
  	@posts = Post.paginate(page: params[:page], per_page: 2).order('created_at DESC')

INSERT INTO "posts" ("caption", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.create(post_params)